Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: لا يسمعون فيها لغوا إلا سلاما ولهم رزقهم فيها بكرة وعشيا
en: They hear therein no idle talk, but only Peace; and therein they have food for morn and evening.

source: تلك الجنة التي نورث من عبادنا من كان تقيا
en: Such is the Garden which We cause the devout among Our bondmen to inherit.

source: وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا وما بين ذلك وما كان ربك نسيا
en: We (angels) come not down save by commandment of thy Lord. Unto Him belongeth all that is before us and all that is behind us and all that is between those two, and thy Lord was never forgetful -

source: رب السماوات والأرض وما بينهما فاعبده واصطبر لعبادته هل تعلم له سميا
en: Lord of the heavens and the earth and all that is between them! Therefor, worship thou Him and be thou steadfast in His service. Knowest thou one that can be named along with Him?

source: ويقول الإنسان أإذا ما مت لسوف أخرج حيا
en: And man saith: When I am dead, shall I forsooth be brought forth alive?

source: أولا يذكر الإنسان أنا خلقناه من قبل ولم يك شيئا
en: Doth not man remember that We created him before, when he was naught?

source: فوربك لنحشرنهم والشياطين ثم لنحضرنهم حول جهنم جثيا
en: And, by thy Lord, verily We shall assemble them and the devils, then We shall bring them, crouching, around hell.

source: ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا
en: Then We shall pluck out from every sect whichever of them was most stubborn in rebellion to the Beneficent.

source: ثم لنحن أعلم بالذين هم أولى بها صليا
en: And surely We are Best Aware of those most worthy to be burned therein.

source: وإن منكم إلا واردها كان على ربك حتما مقضيا
en: There is not one of you but shall approach it. That is a fixed ordinance of thy Lord.

source: ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا
en: Then We shall rescue those who kept from evil, and leave the evil-doers crouching there.

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للذين آمنوا أي الفريقين خير مقاما وأحسن نديا
en: And when Our clear revelations are recited unto them, those who disbelieve say unto those who believe: Which of the two parties (yours or ours) is better in position, and more imposing as an army?

source: وكم أهلكنا قبلهم من قرن هم أحسن أثاثا ورئيا
en: How many a generation have We destroyed before them, who were more imposing in respect of gear and outward seeming!

source: قل من كان في الضلالة فليمدد له الرحمن مدا حتى إذا رأوا ما يوعدون إما العذاب وإما الساعة فسيعلمون من هو شر مكانا وأضعف جندا
en: Say: As for him who is in error, the Beneficent will verily prolong his span of life until, when they behold that which they were promised, whether it be punishment (in the world), or the Hour (of doom), they will know who is worse in position and who is weaker as an army.

source: ويزيد الله الذين اهتدوا هدى والباقيات الصالحات خير عند ربك ثوابا وخير مردا
en: Allah increaseth in right guidance those who walk aright, and the good deeds which endure are better in thy Lord's sight for reward, and better for resort.

source: أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا
en: Hast thou seen him who disbelieveth in Our revelations and saith: Assuredly I shall be given wealth and children?

source: أطلع الغيب أم اتخذ عند الرحمن عهدا
en: Hath he perused the Unseen, or hath he made a pact with the Beneficent?

source: كلا سنكتب ما يقول ونمد له من العذاب مدا
en: Nay, but We shall record that which he saith and prolong for him a span of torment.

source: ونرثه ما يقول ويأتينا فردا
en: And We shall inherit from him that whereof he spake, and he will come unto Us, alone (without his wealth and children).

source: واتخذوا من دون الله آلهة ليكونوا لهم عزا
en: And they have chosen (other) gods beside Allah that they may be a power for them.

source: كلا سيكفرون بعبادتهم ويكونون عليهم ضدا
en: Nay, but they will deny their worship of them, and become opponents unto them.

source: ألم تر أنا أرسلنا الشياطين على الكافرين تؤزهم أزا
en: Seest thou not that We have set the devils on the disbelievers to confound them with confusion?

source: فلا تعجل عليهم إنما نعد لهم عدا
en: So make no haste against them (O Muhammad). We do but number unto them a sum (of days).

source: يوم نحشر المتقين إلى الرحمن وفدا
en: On the day when We shall gather the righteous unto the Beneficent, a goodly company.

source: ونسوق المجرمين إلى جهنم وردا
en: And drive the guilty unto hell, a weary herd,

source: لا يملكون الشفاعة إلا من اتخذ عند الرحمن عهدا
en: They will have no power of intercession, save him who hath made a covenant with his Lord.

source: وقالوا اتخذ الرحمن ولدا
en: And they say: The Beneficent hath taken unto Himself a son.

source: لقد جئتم شيئا إدا
en: Assuredly ye utter a disastrous thing

source: تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا
en: Whereby almost the heavens are torn, and the earth is split asunder and the mountains fall in ruins,

source: أن دعوا للرحمن ولدا
en: That ye ascribe unto the Beneficent a son,

source: وما ينبغي للرحمن أن يتخذ ولدا
en: When it is not meet for (the Majesty of) the Beneficent that He should choose a son.

source: إن كل من في السماوات والأرض إلا آتي الرحمن عبدا
en: There is none in the heavens and the earth but cometh unto the Beneficent as a slave.

source: لقد أحصاهم وعدهم عدا
en: Verily He knoweth them and numbereth them with (right) numbering.

source: وكلهم آتيه يوم القيامة فردا
en: And each one of them will come unto Him on the Day of Resurrection, alone.

source: إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا
en: Lo! those who believe and do good works, the Beneficent will appoint for them love.

source: فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا
en: And We make (this Scripture) easy in thy tongue, (O Muhammad) only that thou mayst bear good tidings therewith unto those who ward off (evil), and warn therewith the froward folk.

source: وكم أهلكنا قبلهم من قرن هل تحس منهم من أحد أو تسمع لهم ركزا
en: And how many a generation before them have We destroyed! Canst thou (Muhammad) see a single man of them, or hear from them the slightest sound?

source: طه
en: Ta. Ha.

source: ما أنزلنا عليك القرآن لتشقى
en: We have not revealed unto thee (Muhammad) this Qur'an that thou shouldst be distressed,

source: إلا تذكرة لمن يخشى
en: But as a reminder unto him who feareth,

source: تنزيلا ممن خلق الأرض والسماوات العلى
en: A revelation from Him Who created the earth and the high heavens,

source: الرحمن على العرش استوى
en: The Beneficent One, Who is established on the Throne.

source: له ما في السماوات وما في الأرض وما بينهما وما تحت الثرى
en: Unto Him belongeth whatsoever is in the heavens and whatsoever is in the earth, and whatsoever is between them, and whatsoever is beneath the sod.

source: وإن تجهر بالقول فإنه يعلم السر وأخفى
en: And if thou speakest aloud, then lo! He knoweth the secret (thought) and (that which is yet) more hidden.

source: الله لا إله إلا هو له الأسماء الحسنى
en: Allah! There is no Allah save Him. His are the most beautiful names.

source: وهل أتاك حديث موسى
en: Hath there come unto thee the story of Moses?

source: إذ رأى نارا فقال لأهله امكثوا إني آنست نارا لعلي آتيكم منها بقبس أو أجد على النار هدى
en: When he saw a fire and said unto his folk: Lo! Wait! I see a fire afar off. Peradventure I may bring you a brand therefrom or may find guidance at the fire.

source: فلما أتاها نودي يا موسى
en: And when he reached it, he was called by name: O Moses!

source: إني أنا ربك فاخلع نعليك إنك بالواد المقدس طوى
en: Lo! I, even I, am thy Lord, So take off thy shoes, for lo! thou art in the holy valley of Tuwa.

source: وأنا اخترتك فاستمع لما يوحى
en: And I have chosen thee, so hearken unto that which is inspired.

source: إنني أنا الله لا إله إلا أنا فاعبدني وأقم الصلاة لذكري
en: Lo! I, even I, am Allah, There is no Allah save Me. So serve Me and establish worship for My remembrance.

source: إن الساعة آتية أكاد أخفيها لتجزى كل نفس بما تسعى
en: Lo! the Hour is surely coming. But I will to keep it hidden, that every soul may be rewarded for that which it striveth (to achieve).

source: فلا يصدنك عنها من لا يؤمن بها واتبع هواه فتردى
en: Therefor, let not him turn thee aside from (the thought of) it who believeth not therein but followeth his own desire, lest thou perish.

source: وما تلك بيمينك يا موسى
en: And what is that in thy right hand, O Moses?

source: قال هي عصاي أتوكأ عليها وأهش بها على غنمي ولي فيها مآرب أخرى
en: He said: This is my staff whereon I lean, and wherewith I bear down branches for my sheep, and wherein I find other uses.

source: قال ألقها يا موسى
en: He said: Cast it down, O Moses!

source: فألقاها فإذا هي حية تسعى
en: So he cast it down, and lo! it was a serpent, gliding.

source: قال خذها ولا تخف سنعيدها سيرتها الأولى
en: He said: Grasp it and fear not. We shall return it to its former state.

source: واضمم يدك إلى جناحك تخرج بيضاء من غير سوء آية أخرى
en: And thrust thy hand within thine armpit, it will come forth white without hurt. (That will be) another token.

source: لنريك من آياتنا الكبرى
en: That We may show thee (some) of Our greater portents,

source: اذهب إلى فرعون إنه طغى
en: Go thou unto Pharaoh! Lo! he hath transgressed (the bounds).

source: قال رب اشرح لي صدري
en: (Moses) said: My Lord! relieve my mind

source: ويسر لي أمري
en: And ease my task for me;

source: واحلل عقدة من لساني
en: And loose a knot from my tongue,

source: يفقهوا قولي
en: That they may understand my saying.

source: واجعل لي وزيرا من أهلي
en: Appoint for me a henchman from my folk,

source: هارون أخي
en: Aaron, my brother.

source: اشدد به أزري
en: Confirm my strength with him

source: وأشركه في أمري
en: And let him share my task,

source: كي نسبحك كثيرا
en: That we may glorify Thee much

source: ونذكرك كثيرا
en: And much remember Thee.

source: إنك كنت بنا بصيرا
en: Lo! Thou art ever Seeing us.

source: قال قد أوتيت سؤلك يا موسى
en: He said: Thou art granted thy request, O Moses.

source: ولقد مننا عليك مرة أخرى
en: And indeed, another time, already We have shown thee favour,

source: إذ أوحينا إلى أمك ما يوحى
en: When we inspired in thy mother that which is inspired,

source: أن اقذفيه في التابوت فاقذفيه في اليم فليلقه اليم بالساحل يأخذه عدو لي وعدو له وألقيت عليك محبة مني ولتصنع على عيني
en: Saying: Throw him into the ark, and throw it into the river, then the river shall throw it on to the bank, and there an enemy to Me and an enemy to him shall take him. And I endued thee with love from Me that thou mightest be trained according to My will,

source: إذ تمشي أختك فتقول هل أدلكم على من يكفله فرجعناك إلى أمك كي تقر عينها ولا تحزن وقتلت نفسا فنجيناك من الغم وفتناك فتونا فلبثت سنين في أهل مدين ثم جئت على قدر يا موسى
en: When thy sister went and said: Shall I show you one who will nurse him? and we restored thee to thy mother that her eyes might be refreshed and might not sorrow. And thou didst kill a man and We delivered thee from great distress, and tried thee with a heavy trial. And thou didst tarry years among the folk of Midian. Then camest thou (hither) by (My) providence, O Moses,

source: واصطنعتك لنفسي
en: And I have attached thee to Myself.

source: اذهب أنت وأخوك بآياتي ولا تنيا في ذكري
en: Go, thou and thy brother, with My tokens, and be not faint in remembrance of Me.

source: اذهبا إلى فرعون إنه طغى
en: Go, both of you, unto Pharaoh. Lo! he hath transgressed (the bounds).

source: فقولا له قولا لينا لعله يتذكر أو يخشى
en: And speak unto him a gentle word, that peradventure he may heed or fear.

source: قالا ربنا إننا نخاف أن يفرط علينا أو أن يطغى
en: They said: Our Lord! Lo! we fear that he may be beforehand with us or that he may play the tyrant.

source: قال لا تخافا إنني معكما أسمع وأرى
en: He said: Fear not. Lo! I am with you twain, Hearing and Seeing.

source: فأتياه فقولا إنا رسولا ربك فأرسل معنا بني إسرائيل ولا تعذبهم قد جئناك بآية من ربك والسلام على من اتبع الهدى
en: So go ye unto him and say: Lo! we are two messengers of thy Lord. So let the children of Israel go with us, and torment them not. We bring thee a token from thy Lord. And peace will be for him who followeth right guidance.

source: إنا قد أوحي إلينا أن العذاب على من كذب وتولى
en: Lo! it hath been revealed unto us that the doom will be for him who denieth and turneth away.

source: قال فمن ربكما يا موسى
en: (Pharaoh) said: Who then is the Lord of you twain, O Moses?

source: قال ربنا الذي أعطى كل شيء خلقه ثم هدى
en: He said: Our Lord is He Who gave unto everything its nature, then guided it aright.

source: قال فما بال القرون الأولى
en: He said: What then is the state of the generations of old?

source: قال علمها عند ربي في كتاب لا يضل ربي ولا ينسى
en: He said: The knowledge thereof is with my Lord in a Record. My Lord neither erreth nor forgetteth,

source: الذي جعل لكم الأرض مهدا وسلك لكم فيها سبلا وأنزل من السماء ماء فأخرجنا به أزواجا من نبات شتى
en: Who hath appointed the earth as a bed and hath threaded roads for you therein and hath sent down water from the sky and thereby We have brought forth divers kinds of vegetation,

source: كلوا وارعوا أنعامكم إن في ذلك لآيات لأولي النهى
en: (Saying): Eat ye and feed your cattle. Lo! herein verily are portents for men of thought.

source: منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى
en: Thereof We created you, and thereunto We return you, and thence We bring you forth a second time.

source: ولقد أريناه آياتنا كلها فكذب وأبى
en: And We verily did show him all Our tokens, but he denied them and refused.

source: قال أجئتنا لتخرجنا من أرضنا بسحرك يا موسى
en: He said: Hast come to drive us out from our land by thy magic, O Moses?

source: فلنأتينك بسحر مثله فاجعل بيننا وبينك موعدا لا نخلفه نحن ولا أنت مكانا سوى
en: But we surely can produce for thee magic the like thereof; so appoint a tryst between us and you, which neither we nor thou shall fail to keep, at a place convenient (to us both).

source: قال موعدكم يوم الزينة وأن يحشر الناس ضحى
en: (Moses) said: Your tryst shall be the day of the feast, and let the people assemble when the sun hath risen high.

source: فتولى فرعون فجمع كيده ثم أتى
en: Then Pharaoh went and gathered his strength, then came (to the appointed tryst).

source: قال لهم موسى ويلكم لا تفتروا على الله كذبا فيسحتكم بعذاب وقد خاب من افترى
en: Moses said unto them: Woe unto you! Invent not a lie against Allah, lest He extirpate you by some punishment. He who lieth faileth miserably.

source: فتنازعوا أمرهم بينهم وأسروا النجوى
en: Then they debated one with another what they must do, and they kept their counsel secret.

source: قالوا إن هذان لساحران يريدان أن يخرجاكم من أرضكم بسحرهما ويذهبا بطريقتكم المثلى
en: They said: Lo! these are two wizards who would drive you out from your country by their magic, and destroy your best traditions;

source: فأجمعوا كيدكم ثم ائتوا صفا وقد أفلح اليوم من استعلى
en: So arrange your plan, and come in battle line. Whoso is uppermost this day will be indeed successful.

source: قالوا يا موسى إما أن تلقي وإما أن نكون أول من ألقى
en: They said: O Moses! Either throw first, or let us be the first to throw?

source: قال بل ألقوا فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى
en: He said: Nay, do ye throw! Then lo! their cords and their staves, by their magic, appeared to him as though they ran.

source: فأوجس في نفسه خيفة موسى
en: And Moses conceived a fear in his mind.

source: قلنا لا تخف إنك أنت الأعلى
en: We said: Fear not! Lo! thou art the higher.

source: وألق ما في يمينك تلقف ما صنعوا إنما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى
en: Throw that which is in thy right hand! It will eat up that which they have made. Lo! that which they have made is but a wizard's artifice, and a wizard shall not be successful to whatever point (of skill) he may attain.

source: فألقي السحرة سجدا قالوا آمنا برب هارون وموسى
en: Then the wizards were (all) flung down prostrate, crying: We believe in the Lord of Aaron and Moses.

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم في جذوع النخل ولتعلمن أينا أشد عذابا وأبقى
en: (Pharaoh) said: Ye put faith in him before I give you leave. Lo! he is your chief who taught you magic. Now surely I shall cut off your hands and your feet alternately, and I shall crucify you on the trunks of palm trees, and ye shall know for certain which of us hath sterner and more lasting punishment.

source: قالوا لن نؤثرك على ما جاءنا من البينات والذي فطرنا فاقض ما أنت قاض إنما تقضي هذه الحياة الدنيا
en: They said: We choose thee not above the clear proofs that have come unto us, and above Him Who created us. So decree what thou wilt decree. Thou wilt end for us only this life of the world.

source: إنا آمنا بربنا ليغفر لنا خطايانا وما أكرهتنا عليه من السحر والله خير وأبقى
en: Lo! we believe in our Lord, that He may forgive us our sins and the magic unto which thou didst force us. Allah is better and more lasting.

source: إنه من يأت ربه مجرما فإن له جهنم لا يموت فيها ولا يحيى
en: Lo! whoso cometh guilty unto his Lord, verily for him is hell. There he will neither die nor live.

source: ومن يأته مؤمنا قد عمل الصالحات فأولئك لهم الدرجات العلى
en: But whoso cometh unto Him a believer, having done good works, for such are the high stations;

source: جنات عدن تجري من تحتها الأنهار خالدين فيها وذلك جزاء من تزكى
en: Gardens of Eden underneath which rivers flow, wherein they will abide for ever. That is the reward of him who groweth.

source: ولقد أوحينا إلى موسى أن أسر بعبادي فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى
en: And verily We inspired Moses, saying: Take away My slaves by night and strike for them a dry path in the sea, fearing not to be overtaken, neither being afraid (of the sea).

source: فأتبعهم فرعون بجنوده فغشيهم من اليم ما غشيهم
en: Then Pharaoh followed them with his hosts and there covered them that which did cover them of the sea.

source: وأضل فرعون قومه وما هدى
en: And Pharaoh led his folk astray, he did not guide them.

source: يا بني إسرائيل قد أنجيناكم من عدوكم وواعدناكم جانب الطور الأيمن ونزلنا عليكم المن والسلوى
en: O Children of Israel! We delivered you from your enemy, and we made a covenant with you on the holy mountain's side, and sent down on you the manna and the quails,

source: كلوا من طيبات ما رزقناكم ولا تطغوا فيه فيحل عليكم غضبي ومن يحلل عليه غضبي فقد هوى
en: (Saying): Eat of the good things wherewith We have provided you, and transgress not in respect thereof lest My wrath come upon you: and he on whom My wrath cometh, he is lost indeed.

source: وإني لغفار لمن تاب وآمن وعمل صالحا ثم اهتدى
en: And lo! verily I am Forgiving toward him who repenteth and believeth and doeth good, and afterward walketh aright.

source: وما أعجلك عن قومك يا موسى
en: And (it was said): What hath made thee hasten from thy folk, O Moses?

source: قال هم أولاء على أثري وعجلت إليك رب لترضى
en: He said: They are close upon my track. I hastened unto Thee, my Lord, that Thou mightest be well pleased.

source: قال فإنا قد فتنا قومك من بعدك وأضلهم السامري
en: He said: Lo! We have tried thy folk in thine absence, and As-Samiri hath misled them.

source: فرجع موسى إلى قومه غضبان أسفا قال يا قوم ألم يعدكم ربكم وعدا حسنا أفطال عليكم العهد أم أردتم أن يحل عليكم غضب من ربكم فأخلفتم موعدي
en: Then Moses went back unto his folk, angry and sad. He said: O my people! Hath not your Lord promised you a fair promise? Did the time appointed then appear too long for you, or did ye wish that wrath from your Lord should come upon you, that ye broke tryst with me?

source: قالوا ما أخلفنا موعدك بملكنا ولكنا حملنا أوزارا من زينة القوم فقذفناها فكذلك ألقى السامري
en: They said: We broke not tryst with thee of our own will, but we were laden with burdens of ornaments of the folk, then cast them (in the fire), for thus As-Samiri proposed.

source: فأخرج لهم عجلا جسدا له خوار فقالوا هذا إلهكم وإله موسى فنسي
en: Then he produced for them a calf, of saffron hue, which gave forth a lowing sound. And they cried: This is your god and the god of Moses, but he hath forgotten.

source: أفلا يرون ألا يرجع إليهم قولا ولا يملك لهم ضرا ولا نفعا
en: See they not, then, that it returneth no saying unto them and possesseth for them neither hurt nor use?

source: ولقد قال لهم هارون من قبل يا قوم إنما فتنتم به وإن ربكم الرحمن فاتبعوني وأطيعوا أمري
en: And Aaron indeed had told them beforehand: O my people! Ye are but being seduced therewith, for lo! your Lord is the Beneficent, so follow me and obey my order.

source: قالوا لن نبرح عليه عاكفين حتى يرجع إلينا موسى
en: They said: We shall by no means cease to be its votaries till Moses return unto us.

source: قال يا هارون ما منعك إذ رأيتهم ضلوا
en: He (Moses) said: O Aaron! What held thee back when thou didst see them gone astray,

source: ألا تتبعن أفعصيت أمري
en: That thou followedst me not? Hast thou then disobeyed my order?

source: قال يا ابن أم لا تأخذ بلحيتي ولا برأسي إني خشيت أن تقول فرقت بين بني إسرائيل ولم ترقب قولي
en: He said: O son of my mother! Clutch not my beard nor my head! I feared lest thou shouldst say: Thou hast caused division among the Children of Israel, and hast not waited for my word.

source: قال فما خطبك يا سامري
en: (Moses) said: And what hast thou to say, O Samiri?

source: قال بصرت بما لم يبصروا به فقبضت قبضة من أثر الرسول فنبذتها وكذلك سولت لي نفسي
en: He said: I perceived what they perceive not, so I seized a handful from the footsteps of the messenger, and then threw it in. Thus my soul commended to me.

source: قال فاذهب فإن لك في الحياة أن تقول لا مساس وإن لك موعدا لن تخلفه وانظر إلى إلهك الذي ظلت عليه عاكفا لنحرقنه ثم لننسفنه في اليم نسفا
en: (Moses) said: Then go! and lo! in this life it is for thee to say: Touch me not! and lo! there is for thee a tryst thou canst not break. Now look upon thy god of which thou hast remained a votary. Verily we will burn it and will scatter its dust over the sea.

source: إنما إلهكم الله الذي لا إله إلا هو وسع كل شيء علما
en: Your Allah is only Allah, than Whom there is no other Allah. He embraceth all things in His knowledge.

source: كذلك نقص عليك من أنباء ما قد سبق وقد آتيناك من لدنا ذكرا
en: Thus relate We unto thee (Muhammad) some tidings of that which happened of old, and We have given thee from Our presence a reminder.

source: من أعرض عنه فإنه يحمل يوم القيامة وزرا
en: Whoso turneth away from it, he verily will bear a burden on the Day of Resurrection,

source: خالدين فيه وساء لهم يوم القيامة حملا
en: Abiding under it - an evil burden for them on the Day of Resurrection,

source: يوم ينفخ في الصور ونحشر المجرمين يومئذ زرقا
en: The day when the Trumpet is blown. On that day we assemble the guilty white-eyed (with terror),

source: يتخافتون بينهم إن لبثتم إلا عشرا
en: Murmuring among themselves: Ye have tarried but ten (days).

source: نحن أعلم بما يقولون إذ يقول أمثلهم طريقة إن لبثتم إلا يوما
en: We are Best Aware of what they utter when their best in conduct say: Ye have tarried but a day.

source: ويسألونك عن الجبال فقل ينسفها ربي نسفا
en: They will ask thee of the mountains (on that day). Say: My Lord will break them into scattered dust.

source: فيذرها قاعا صفصفا
en: And leave it as an empty plain,

source: لا ترى فيها عوجا ولا أمتا
en: Wherein thou seest neither curve nor ruggedness.

source: يومئذ يتبعون الداعي لا عوج له وخشعت الأصوات للرحمن فلا تسمع إلا همسا
en: On that day they follow the summoner who deceiveth not, and voices are hushed for the Beneficent, and thou hearest but a faint murmur.

source: يومئذ لا تنفع الشفاعة إلا من أذن له الرحمن ورضي له قولا
en: On that day no intercession availeth save (that of) him unto whom the Beneficent hath given leave and whose word He accepteth.

source: يعلم ما بين أيديهم وما خلفهم ولا يحيطون به علما
en: He knoweth (all) that is before them and (all) that is behind them, while they cannot compass it in knowledge.

source: وعنت الوجوه للحي القيوم وقد خاب من حمل ظلما
en: And faces humble themselves before the Living, the Eternal. And he who beareth (a burden of) wrongdoing is indeed a failure (on that day).
